Revit 2024 API
ElementIsCurveDrivenFilter.PassesFilter Method
Overload List
Name | Description
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
See Also
ElementIsCurveDrivenFilter Class
ElementIsCurveDrivenFilter Members
Autodesk.Revit.DB Namespace